faronov/efr32mg1p-zigbee-sensor/app.c
/**
 * @file app.c
 * @brief Application logic for Zigbee BME280 Sensor
 */

#include "sl_component_catalog.h"
#include "zigbee_app_framework_event.h"
#include "app/framework/include/af.h"
#include "zap-config.h"
// #include "app/framework/plugin/network-steering/network-steering.h" // REMOVED - causes event queue crash
#include "app_sensor.h"
#include "app_config.h"
#include "stack/include/network-formation.h"  // For manual network join
#include "stack/include/security.h"
#include "sl_sleeptimer.h"
#include <stdio.h>
#include <string.h>

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
#include "sl_simple_button_instances.h"
#endif

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
#include "sl_simple_led_instances.h"
#endif

// LED blink event for network joining indication
static sl_zigbee_event_t led_blink_event;
static bool led_blink_active = false;

// LED off timer - turn off LED after network join confirmation
static sl_zigbee_event_t led_off_event;

static uint8_t join_attempt_count = 0;
#define JOIN_SCAN_DURATION 3  // Active scan duration (Zigbee scan exponent)

// Button action flags (set by ISR, cleared by main loop)
// Using volatile because these are accessed from both ISR and main context
static volatile bool button_short_press_pending = false;
static volatile bool button_long_press_pending = false;

// Button press duration tracking
static uint32_t button_press_start_tick = 0;
static bool button_pressed = false;
#define LONG_PRESS_THRESHOLD_MS 5000  // 5 seconds for long press (leave/rejoin network)

// Optimized rejoin state machine (TEMPORARILY DISABLED - event queue issue)
// typedef enum {
//   REJOIN_STATE_IDLE,
//   REJOIN_STATE_CURRENT_CHANNEL,
//   REJOIN_STATE_ALL_CHANNELS,
//   REJOIN_STATE_DONE
// } RejoinState_t;

// static sl_zigbee_event_t rejoin_retry_event;
// static RejoinState_t rejoin_state = REJOIN_STATE_IDLE;
// static uint8_t saved_channel = 0;

// Rejoin timeout configuration
#define REJOIN_CURRENT_CHANNEL_TIMEOUT_MS  500   // Wait 500ms before trying all channels
#define REJOIN_FULL_SCAN_TIMEOUT_MS        5000  // Wait 5s for full scan to complete

// Channel mask helper macro
#ifndef BIT32
#define BIT32(n) (((uint32_t)1) << (n))
#endif

#if defined(__GNUC__)
#define APP_UNUSED __attribute__((unused))
#else
#define APP_UNUSED
#endif

#ifndef APP_DEBUG_DIAG_ALWAYS
#define APP_DEBUG_DIAG_ALWAYS 0
#endif
#define APP_DEBUG_PRINTF(...) printf(__VA_ARGS__)

static void handle_short_press(void);

void app_debug_sanity(void)
{
  APP_DEBUG_PRINTF("app_debug_sanity\n");
}

void app_debug_trigger_short_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_short_press\n");
  handle_short_press();
}

// Zigbee 3.0 channels (11-26)
#define ZIGBEE_CHANNELS_MASK 0x07FFF800

// Single-channel network join state (Series 1 workaround for event queue limitation)
// Try channels in order of popularity: 15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23
static const uint8_t channel_scan_order[] = {15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23};
static uint8_t current_channel_index = 0;  // Index into channel_scan_order array
static bool network_join_in_progress = false;
static bool join_scan_in_progress = false;
static bool join_network_found = false;
static EmberZigbeeNetwork join_candidate;
static bool af_init_seen = false;
static bool af_init_reported = false;
static bool basic_identity_pending = false;
static bool af_init_force_pending = false;
static uint32_t af_init_force_tick = 0;
static uint32_t basic_identity_tick = 0;

static uint8_t generatedDefaults[] = GENERATED_DEFAULTS;
static EmberAfAttributeMetadata generatedAttributes[] = GENERATED_ATTRIBUTES;
static EmberAfCluster generatedClusters[] = GENERATED_CLUSTERS;
static EmberAfEndpointType generatedEndpointTypes[] = {
  { generatedClusters, GENERATED_CLUSTER_COUNT, ATTRIBUTE_MAX_SIZE }
};

static void app_register_dynamic_endpoint(void);
void app_debug_poll(void);
static bool join_pending = false;
static bool join_security_configured = false;

#ifndef EMBER_ENCRYPTION_KEY_SIZE
#define EMBER_ENCRYPTION_KEY_SIZE 16
#endif

static const uint8_t zigbee_alliance_key[EMBER_ENCRYPTION_KEY_SIZE] = {
  0x5A, 0x69, 0x67, 0x42, 0x65, 0x65, 0x41, 0x6C,
  0x6C, 0x69, 0x61, 0x6E, 0x63, 0x65, 0x30, 0x39
};

// Forward declarations
static void led_blink_event_handler(sl_zigbee_event_t *event);
static void led_off_event_handler(sl_zigbee_event_t *event);
static void rejoin_retry_event_handler(sl_zigbee_event_t *event) APP_UNUSED;
static void start_optimized_rejoin(void) APP_UNUSED;
static void handle_short_press(void);
static void handle_long_press(void);
static EmberStatus start_join_scan(void);
static void try_next_channel(void);
static void configure_join_security(void);
static bool log_basic_identity(void);

/**
 * @brief Zigbee application init callback
 *
 * Called when the Zigbee stack has completed initialization.
 * This is where we initialize application components.
 */
void emberAfInitCallback(void)
{
  if (af_init_seen) {
    APP_DEBUG_PRINTF("AF init callback (duplicate)\n");
    return;
  }
  APP_DEBUG_PRINTF("AF init callback\n");
  af_init_seen = true;
  af_init_force_pending = false;
  af_init_force_tick = 0;
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  app_register_dynamic_endpoint();

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();
  if (!log_basic_identity()) {
    basic_identity_pending = true;
  }

  // TEMPORARILY DISABLE sensor to reduce event usage (event queue issue)
  // Initialize BME280 sensor
  // if (!app_sensor_init()) {
  //   emberAfCorePrintln("ERROR: Sensor initialization failed!");
  // #ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  //   // Rapid blink on error
  //   for (int i = 0; i < 10; i++) {
  //     sl_led_toggle(&sl_led_led0);
  //     sl_sleeptimer_delay_millisecond(100);
  //   }
  // #endif
  // }
  emberAfCorePrintln("Sensor DISABLED for testing - event queue issue");
}

static void app_register_dynamic_endpoint(void)
{
  EmberAfStatus status = emberAfSetDynamicEndpoint(0,
                                                   1,
                                                   0x0104,
                                                   0x0302,
                                                   1,
                                                   &generatedEndpointTypes[0]);
  APP_DEBUG_PRINTF("Dynamic endpoint set -> 0x%02x\n", status);
}

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init requested (debug)\n");
    af_init_force_pending = true;
  }
#endif
}

