faronov/efr32mg1p-zigbee-sensor/app.c
void app_debug_poll(void)
{
  uint32_t now = sl_sleeptimer_get_tick_count();

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (af_init_force_pending && !af_init_seen) {
    if (af_init_force_tick == 0) {
      af_init_force_tick = now;
    } else if (sl_sleeptimer_tick_to_ms(now - af_init_force_tick) >= 2000) {
      APP_DEBUG_PRINTF("AF init forced (timeout)\n");
      emberAfInitCallback();
      af_init_force_pending = false;
    }
  }

  if (basic_identity_pending && af_init_seen) {
    if (basic_identity_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - basic_identity_tick) >= 2000) {
      basic_identity_tick = now;
      if (log_basic_identity()) {
        basic_identity_pending = false;
      }
    }
  }
}

static bool log_basic_identity(void)
{
  uint8_t buf[1 + 32];
  char str[33];
  EmberAfStatus st;
  uint8_t endpoint_count = emberAfEndpointCount();
  if (endpoint_count == 0) {
    APP_DEBUG_PRINTF("Basic: endpoints not ready (count=0)\n");
    return false;
  }
  uint8_t endpoint = emberAfEndpointFromIndex(0);
  APP_DEBUG_PRINTF("Basic: using endpoint %u (count=%u)\n",
                   endpoint,
                   endpoint_count);

#ifdef ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: manufacturer=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: manufacturer read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: model=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: model read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_SW_BUILD_ID_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_SW_BUILD_ID_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: sw build=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: sw build read -> 0x%02x\n", st);
  }
#endif
  return true;
}


/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

    // Schedule LED to turn off after 3 seconds to save power
    sl_zigbee_event_set_delay_ms(&led_off_event, 3000);
#endif

    // Sensor DISABLED for testing (event queue issue)
    // Perform initial sensor reading after joining
    // app_sensor_update();

    // Restart periodic sensor updates
    // app_sensor_start_periodic_updates();

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    emberAfCorePrintln("Network down - will attempt optimized rejoin");

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

    // Sensor timer will automatically stop reading when event handler checks network state
    // Device will use minimal power while waiting for network

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);
  }
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
          button_long_press_pending = true;
        } else {
          button_short_press_pending = true;
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfTickCallback(void)
{
  static uint32_t last_heartbeat_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();
  app_debug_poll();

  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting\n");
    handle_short_press();
  }

